run/acousticCavitationCloudFoam/validation_cubicReactor3D_Nowak2013/constant/charactMap_Nowak2013_Ic_OF
// A characteristic map for 
// Ic(REqu, pAc)
// data(
//     equilibrium radius,
//     acoustic pressure amplitude
// )
//
// Loaded via transportProperties.
//
// Table structure:
//  (
//      REqu 1
//      (
//          (pAc 1     Ic 1)
//          (pAc 2     Ic 2)
//          (...)
//      )
//      REqu 2
//      (...
//      )
//  )
(
    (
        1e-06
        (
            (0.000000e+00    0.000000e+00)
            (1.013000e+04    1.102504e-19)
            (1.519500e+04    1.658900e-19)
            (2.026000e+04    2.221562e-19)
            (2.532500e+04    2.792730e-19)
            (3.039000e+04    3.374789e-19)
            (3.545500e+04    3.970307e-19)
            (4.052000e+04    4.582091e-19)
            (4.558500e+04    5.213248e-19)
            (5.065000e+04    5.867265e-19)
            (5.571500e+04    6.548106e-19)
            (6.078000e+04    7.260331e-19)
            (6.584500e+04    8.009260e-19)
            (7.091000e+04    8.801174e-19)
            (7.597500e+04    9.643610e-19)
            (8.104000e+04    1.054573e-18)
            (8.610500e+04    1.151885e-18)
            (9.117000e+04    1.257726e-18)
            (9.623500e+04    1.373930e-18)
            (1.013000e+05    1.502916e-18)
            (1.063650e+05    1.647969e-18)
            (1.114300e+05    1.813714e-18)
            (1.164950e+05    2.006966e-18)
            (1.215600e+05    2.238416e-18)
            (1.266250e+05    2.526368e-18)
            (1.316900e+05    2.906738e-18)
            (1.367550e+05    3.470589e-18)
            (1.418200e+05    4.919359e-18)
            (1.468850e+05    1.616982e-14)
            (1.519500e+05    3.683430e-14)
            (1.570150e+05    5.573713e-14)
            (1.620800e+05    6.928972e-14)
            (1.671450e+05    7.414948e-14)
            (1.722100e+05    6.722909e-14)
            (1.772750e+05    4.569941e-14)
            (1.823400e+05    6.987779e-15)
            (1.874050e+05    -5.122871e-14)
            (1.924700e+05    -1.310330e-13)
            (1.975350e+05    -2.342825e-13)
            (2.026000e+05    -3.626227e-13)
            (2.076650e+05    -5.175026e-13)
            (2.127300e+05    -7.001902e-13)
            (2.177950e+05    -9.117862e-13)
            (2.228600e+05    -1.153242e-12)
            (2.279250e+05    -1.425368e-12)
            (2.329900e+05    -1.728850e-12)
            (2.380550e+05    -2.064260e-12)
            (2.431200e+05    -2.432070e-12)
            (2.481850e+05    -2.832659e-12)
            (2.532500e+05    -3.266320e-12)
            (2.583150e+05    -3.733273e-12)
            (2.633800e+05    -4.233678e-12)
            (2.684450e+05    -4.767628e-12)
            (2.735100e+05    -5.335166e-12)
            (2.785750e+05    -5.936286e-12)
            (2.836400e+05    -6.570945e-12)
            (2.887050e+05    -7.239051e-12)
            (2.937700e+05    -7.940498e-12)
            (2.988350e+05    -8.675135e-12)
            (3.039000e+05    -9.442796e-12)
        )
    )
    (
        2e-06
        (
            (0.000000e+00    0.000000e+00)
            (1.013000e+04    1.177483e-18)
            (1.519500e+04    1.775335e-18)
            (2.026000e+04    2.384375e-18)
            (2.532500e+04    3.008780e-18)
            (3.039000e+04    3.653138e-18)
            (3.545500e+04    4.322608e-18)
            (4.052000e+04    5.023103e-18)
            (4.558500e+04    5.761549e-18)
            (5.065000e+04    6.546196e-18)
            (5.571500e+04    7.387113e-18)
            (6.078000e+04    8.296790e-18)
            (6.584500e+04    9.291099e-18)
            (7.091000e+04    1.039071e-17)
            (7.597500e+04    1.162328e-17)
            (8.104000e+04    1.302702e-17)
            (8.610500e+04    1.465691e-17)
            (9.117000e+04    1.659612e-17)
            (9.623500e+04    1.897907e-17)
            (1.013000e+05    2.204482e-17)
            (1.063650e+05    2.628727e-17)
            (1.114300e+05    3.308856e-17)
            (1.164950e+05    5.535994e-17)
            (1.215600e+05    1.211550e-15)
            (1.266250e+05    8.409911e-15)
            (1.316900e+05    2.198390e-14)
            (1.367550e+05    4.002791e-14)
            (1.418200e+05    5.997657e-14)
            (1.468850e+05    7.891944e-14)
            (1.519500e+05    9.380885e-14)
            (1.570150e+05    1.016003e-13)
...
);
