run/acousticCavitationCloudFoam/validation_cubicReactor3D_Nowak2013/constant/charactMap_Nowak2013_Is_OF
// A characteristic map for 
// Is(REqu, pAc)
// data(
//     equilibrium radius,
//     acoustic pressure amplitude
// )
//
// Loaded via transportProperties.
//
// Table structure:
//  (
//      REqu 1
//      (
//          (pAc 1     Is 1)
//          (pAc 2     Is 2)
//          (...)
//      )
//      REqu 2
//      (...
//      )
//  )
(
    (
        1e-06
        (
            (0.000000e+00    0.000000e+00)
            (1.013000e+04    1.242434e-22)
            (1.519500e+04    1.873575e-22)
            (2.026000e+04    2.516863e-22)
            (2.532500e+04    3.176773e-22)
            (3.039000e+04    3.858125e-22)
            (3.545500e+04    4.566522e-22)
            (4.052000e+04    5.307756e-22)
            (4.558500e+04    6.088937e-22)
            (5.065000e+04    6.918189e-22)
            (5.571500e+04    7.805426e-22)
            (6.078000e+04    8.761741e-22)
            (6.584500e+04    9.802038e-22)
            (7.091000e+04    1.094226e-21)
            (7.597500e+04    1.220465e-21)
            (8.104000e+04    1.362100e-21)
            (8.610500e+04    1.522279e-21)
            (9.117000e+04    1.706372e-21)
            (9.623500e+04    1.920989e-21)
            (1.013000e+05    2.176093e-21)
            (1.063650e+05    2.485321e-21)
            (1.114300e+05    2.870607e-21)
            (1.164950e+05    3.368359e-21)
            (1.215600e+05    4.042615e-21)
            (1.266250e+05    5.019156e-21)
            (1.316900e+05    6.603446e-21)
            (1.367550e+05    9.841058e-21)
            (1.418200e+05    5.407493e-20)
            (1.468850e+05    3.285527e-14)
            (1.519500e+05    1.012315e-13)
            (1.570150e+05    2.013964e-13)
            (1.620800e+05    3.343015e-13)
            (1.671450e+05    5.005503e-13)
            (1.722100e+05    7.003538e-13)
            (1.772750e+05    9.335772e-13)
            (1.823400e+05    1.199800e-12)
            (1.874050e+05    1.498375e-12)
            (1.924700e+05    1.828474e-12)
            (1.975350e+05    2.189133e-12)
            (2.026000e+05    2.579286e-12)
            (2.076650e+05    2.997795e-12)
            (2.127300e+05    3.443473e-12)
            (2.177950e+05    3.915099e-12)
            (2.228600e+05    4.411443e-12)
            (2.279250e+05    4.931270e-12)
            (2.329900e+05    5.473351e-12)
            (2.380550e+05    6.036475e-12)
            (2.431200e+05    6.619454e-12)
            (2.481850e+05    7.221125e-12)
            (2.532500e+05    7.840352e-12)
            (2.583150e+05    8.476036e-12)
            (2.633800e+05    9.127107e-12)
            (2.684450e+05    9.792536e-12)
            (2.735100e+05    1.047132e-11)
            (2.785750e+05    1.116250e-11)
            (2.836400e+05    1.186515e-11)
            (2.887050e+05    1.257837e-11)
            (2.937700e+05    1.330130e-11)
            (2.988350e+05    1.403310e-11)
            (3.039000e+05    1.477298e-11)
        )
    )
    (
        2e-06
        (
            (0.000000e+00    0.000000e+00)
            (1.013000e+04    2.314639e-21)
            (1.519500e+04    3.498951e-21)
            (2.026000e+04    4.716878e-21)
            (2.532500e+04    5.981119e-21)
            (3.039000e+04    7.306707e-21)
            (3.545500e+04    8.709618e-21)
            (4.052000e+04    1.021191e-20)
            (4.558500e+04    1.183823e-20)
            (5.065000e+04    1.362001e-20)
            (5.571500e+04    1.559646e-20)
            (6.078000e+04    1.782012e-20)
            (6.584500e+04    2.036131e-20)
            (7.091000e+04    2.331913e-20)
            (7.597500e+04    2.683431e-20)
            (8.104000e+04    3.112408e-20)
            (8.610500e+04    3.651640e-20)
            (9.117000e+04    4.356438e-20)
            (9.623500e+04    5.329784e-20)
            (1.013000e+05    6.787486e-20)
            (1.063650e+05    9.284836e-20)
            (1.114300e+05    1.544159e-19)
            (1.164950e+05    2.331718e-18)
            (1.215600e+05    8.366234e-16)
            (1.266250e+05    9.737546e-15)
            (1.316900e+05    3.398470e-14)
            (1.367550e+05    7.851011e-14)
            (1.418200e+05    1.471313e-13)
            (1.468850e+05    2.427413e-13)
            (1.519500e+05    3.674392e-13)
            (1.570150e+05    5.226500e-13)
...
);
