run/acousticCavitationCloudFoam/validation_cubicReactor3D_Nowak2013/constant/charactMap_Nowak2013_PiTh_OF
// A characteristic map for 
// PiTh(REqu, pAc)
// data(
//     equilibrium radius,
//     acoustic pressure amplitude
// )
//
// Loaded via transportProperties.
//
// Table structure:
//  (
//      REqu 1
//      (
//          (pAc 1     PiTh 1)
//          (pAc 2     PiTh 2)
//          (...)
//      )
//      REqu 2
//      (...
//      )
//  )
(
    (
        1e-06
        (
            (1.013000e+04    3.780834e-14)
            (1.519500e+04    8.506934e-14)
            (2.026000e+04    1.520439e-13)
            (2.532500e+04    2.388624e-13)
            (3.039000e+04    3.467175e-13)
            (3.545500e+04    4.745182e-13)
            (4.052000e+04    6.256465e-13)
            (4.558500e+04    8.006394e-13)
            (5.065000e+04    9.996077e-13)
            (5.571500e+04    1.226605e-12)
            (6.078000e+04    1.482524e-12)
            (6.584500e+04    1.766087e-12)
            (7.091000e+04    2.089278e-12)
            (7.597500e+04    2.453622e-12)
            (8.104000e+04    2.855297e-12)
            (8.610500e+04    3.314378e-12)
            (9.117000e+04    3.823890e-12)
            (9.623500e+04    4.405232e-12)
            (1.013000e+05    5.061193e-12)
            (1.063650e+05    5.829188e-12)
            (1.114300e+05    6.725409e-12)
            (1.164950e+05    7.790728e-12)
            (1.215600e+05    9.082272e-12)
            (1.266250e+05    1.073193e-11)
            (1.316900e+05    1.297543e-11)
            (1.367550e+05    1.656038e-11)
            (1.418200e+05    4.494894e-11)
            (1.468850e+05    1.152906e-06)
            (1.519500e+05    3.794049e-06)
            (1.570150e+05    8.522234e-06)
            (1.620800e+05    1.594746e-05)
            (1.671450e+05    2.676827e-05)
            (1.722100e+05    4.182155e-05)
            (1.772750e+05    6.214723e-05)
            (1.823400e+05    8.908334e-05)
            (1.874050e+05    1.243795e-04)
            (1.924700e+05    1.703996e-04)
            (1.975350e+05    2.297378e-04)
            (2.026000e+05    3.056811e-04)
            (2.076650e+05    4.020915e-04)
            (2.127300e+05    5.231682e-04)
            (2.177950e+05    6.733680e-04)
            (2.228600e+05    8.572680e-04)
            (2.279250e+05    1.079502e-03)
            (2.329900e+05    1.344669e-03)
            (2.380550e+05    1.657093e-03)
            (2.431200e+05    2.020962e-03)
            (2.481850e+05    2.440219e-03)
            (2.532500e+05    2.918530e-03)
            (2.583150e+05    3.458990e-03)
            (2.633800e+05    4.064954e-03)
            (2.684450e+05    4.739121e-03)
            (2.735100e+05    5.483847e-03)
            (2.785750e+05    6.301569e-03)
            (2.836400e+05    7.194803e-03)
            (2.887050e+05    8.166237e-03)
            (2.937700e+05    9.215891e-03)
            (2.988350e+05    1.034368e-02)
            (3.039000e+05    1.155100e-02)
        )
    )
    (
        2e-06
        (
            (1.013000e+04    1.068672e-12)
            (1.519500e+04    2.432538e-12)
            (2.026000e+04    4.338610e-12)
            (2.532500e+04    6.847038e-12)
            (3.039000e+04    9.977832e-12)
            (3.545500e+04    1.378508e-11)
            (4.052000e+04    1.827006e-11)
            (4.558500e+04    2.351884e-11)
            (5.065000e+04    2.962000e-11)
            (5.571500e+04    3.667646e-11)
            (6.078000e+04    4.482813e-11)
            (6.584500e+04    5.425650e-11)
            (7.091000e+04    6.514749e-11)
            (7.597500e+04    7.784696e-11)
            (8.104000e+04    9.272458e-11)
            (8.610500e+04    1.104252e-10)
            (9.117000e+04    1.319725e-10)
            (9.623500e+04    1.589354e-10)
            (1.013000e+05    1.942443e-10)
            (1.063650e+05    2.443187e-10)
            (1.114300e+05    3.364531e-10)
            (1.164950e+05    4.232724e-09)
            (1.215600e+05    7.907694e-07)
            (1.266250e+05    1.325893e-06)
            (1.316900e+05    2.271838e-06)
            (1.367550e+05    4.055104e-06)
            (1.418200e+05    7.124245e-06)
            (1.468850e+05    1.197773e-05)
            (1.519500e+05    1.917773e-05)
            (1.570150e+05    2.936514e-05)
            (1.620800e+05    4.328251e-05)
            (1.671450e+05    6.182883e-05)
...
);
