run/acousticCavitationCloudFoam/validation_cubicReactor3D_Nowak2013/constant/charactMap_Nowak2013_PiVi_OF
// A characteristic map for 
// PiVi(REqu, pAc)
// data(
//     equilibrium radius,
//     acoustic pressure amplitude
// )
//
// Loaded via transportProperties.
//
// Table structure:
//  (
//      REqu 1
//      (
//          (pAc 1     PiVi 1)
//          (pAc 2     PiVi 2)
//          (...)
//      )
//      REqu 2
//      (...
//      )
//  )
(
    (
        1e-06
        (
            (1.013000e+04    9.021321e-14)
            (1.519500e+04    2.042939e-13)
            (2.026000e+04    3.665069e-13)
            (2.532500e+04    5.794604e-13)
            (3.039000e+04    8.466709e-13)
            (3.545500e+04    1.172700e-12)
            (4.052000e+04    1.563344e-12)
            (4.558500e+04    2.025880e-12)
            (5.065000e+04    2.569411e-12)
            (5.571500e+04    3.205315e-12)
            (6.078000e+04    3.947865e-12)
            (6.584500e+04    4.815076e-12)
            (7.091000e+04    5.829896e-12)
            (7.597500e+04    7.021877e-12)
            (8.104000e+04    8.429633e-12)
            (8.610500e+04    1.010446e-11)
            (9.117000e+04    1.211591e-11)
            (9.623500e+04    1.456063e-11)
            (1.013000e+05    1.757691e-11)
            (1.063650e+05    2.137001e-11)
            (1.114300e+05    2.625881e-11)
            (1.164950e+05    3.276909e-11)
            (1.215600e+05    4.183994e-11)
            (1.266250e+05    5.535387e-11)
            (1.316900e+05    7.784475e-11)
            (1.367550e+05    1.249581e-10)
            (1.418200e+05    7.766347e-10)
            (1.468850e+05    2.062982e-05)
            (1.519500e+05    4.283883e-05)
            (1.570150e+05    6.743675e-05)
            (1.620800e+05    9.466090e-05)
            (1.671450e+05    1.244748e-04)
            (1.722100e+05    1.567946e-04)
            (1.772750e+05    1.915317e-04)
            (1.823400e+05    2.286047e-04)
            (1.874050e+05    2.679349e-04)
            (1.924700e+05    3.094286e-04)
            (1.975350e+05    3.530198e-04)
            (2.026000e+05    3.986394e-04)
            (2.076650e+05    4.462038e-04)
            (2.127300e+05    4.956297e-04)
            (2.177950e+05    5.468344e-04)
            (2.228600e+05    5.997370e-04)
            (2.279250e+05    6.542610e-04)
            (2.329900e+05    7.103334e-04)
            (2.380550e+05    7.678862e-04)
            (2.431200e+05    8.268562e-04)
            (2.481850e+05    8.871855e-04)
            (2.532500e+05    9.488198e-04)
            (2.583150e+05    1.011709e-03)
            (2.633800e+05    1.075806e-03)
            (2.684450e+05    1.141068e-03)
            (2.735100e+05    1.207453e-03)
            (2.785750e+05    1.274922e-03)
            (2.836400e+05    1.343434e-03)
            (2.887050e+05    1.412949e-03)
            (2.937700e+05    1.483447e-03)
            (2.988350e+05    1.554900e-03)
            (3.039000e+05    1.627274e-03)
        )
    )
    (
        2e-06
        (
            (1.013000e+04    1.281537e-12)
            (1.519500e+04    2.914110e-12)
            (2.026000e+04    5.258676e-12)
            (2.532500e+04    8.378319e-12)
            (3.039000e+04    1.236054e-11)
            (3.545500e+04    1.732295e-11)
            (4.052000e+04    2.342168e-11)
            (4.558500e+04    3.086330e-11)
            (5.065000e+04    3.992245e-11)
            (5.571500e+04    5.096789e-11)
            (6.078000e+04    6.450216e-11)
            (6.584500e+04    8.122394e-11)
            (7.091000e+04    1.021286e-10)
            (7.597500e+04    1.286789e-10)
            (8.104000e+04    1.631095e-10)
            (8.610500e+04    2.090051e-10)
            (9.117000e+04    2.724977e-10)
            (9.623500e+04    3.650349e-10)
            (1.013000e+05    5.109023e-10)
            (1.063650e+05    7.738606e-10)
            (1.114300e+05    1.453599e-09)
            (1.164950e+05    2.419244e-08)
            (1.215600e+05    2.338464e-06)
            (1.266250e+05    9.287964e-06)
            (1.316900e+05    2.027779e-05)
            (1.367550e+05    3.478836e-05)
            (1.418200e+05    5.256599e-05)
            (1.468850e+05    7.342375e-05)
            (1.519500e+05    9.720177e-05)
            (1.570150e+05    1.237578e-04)
            (1.620800e+05    1.529638e-04)
            (1.671450e+05    1.847082e-04)
...
);
