run/acousticCavitationCloudFoam/validation_cubicReactor3D_Nowak2013/constant/charactMap_Nowak2013_RAv_OF
// A characteristic map for 
// RAv(REqu, pAc)
// data(
//     equilibrium radius,
//     acoustic pressure amplitude
// )
//
// Loaded via transportProperties.
//
// Table structure:
//  (
//      REqu 1
//      (
//          (pAc 1     RAv 1)
//          (pAc 2     RAv 2)
//          (...)
//      )
//      REqu 2
//      (...
//      )
//  )
(
    (
        1e-06
        (
            (1.013000e+04    1.004881e-06)
            (1.519500e+04    1.005305e-06)
            (2.026000e+04    1.005902e-06)
            (2.532500e+04    1.006675e-06)
            (3.039000e+04    1.007630e-06)
            (3.545500e+04    1.008771e-06)
            (4.052000e+04    1.010106e-06)
            (4.558500e+04    1.011644e-06)
            (5.065000e+04    1.013395e-06)
            (5.571500e+04    1.015372e-06)
            (6.078000e+04    1.017589e-06)
            (6.584500e+04    1.020064e-06)
            (7.091000e+04    1.022818e-06)
            (7.597500e+04    1.025876e-06)
            (8.104000e+04    1.029270e-06)
            (8.610500e+04    1.033037e-06)
            (9.117000e+04    1.037225e-06)
            (9.623500e+04    1.041891e-06)
            (1.013000e+05    1.047111e-06)
            (1.063650e+05    1.052986e-06)
            (1.114300e+05    1.059650e-06)
            (1.164950e+05    1.067294e-06)
            (1.215600e+05    1.076202e-06)
            (1.266250e+05    1.086833e-06)
            (1.316900e+05    1.100030e-06)
            (1.367550e+05    1.117743e-06)
            (1.418200e+05    1.152600e-06)
            (1.468850e+05    8.573492e-06)
            (1.519500e+05    1.331566e-05)
            (1.570150e+05    1.761779e-05)
            (1.620800e+05    2.175073e-05)
            (1.671450e+05    2.579445e-05)
            (1.722100e+05    2.978201e-05)
            (1.772750e+05    3.372965e-05)
            (1.823400e+05    3.764643e-05)
            (1.874050e+05    4.153772e-05)
            (1.924700e+05    4.540615e-05)
            (1.975350e+05    4.925421e-05)
            (2.026000e+05    5.308349e-05)
            (2.076650e+05    5.689450e-05)
            (2.127300e+05    6.068742e-05)
            (2.177950e+05    6.446220e-05)
            (2.228600e+05    6.821873e-05)
            (2.279250e+05    7.195689e-05)
            (2.329900e+05    7.567665e-05)
            (2.380550e+05    7.937804e-05)
            (2.431200e+05    8.306123e-05)
            (2.481850e+05    8.672647e-05)
            (2.532500e+05    9.037413e-05)
            (2.583150e+05    9.400468e-05)
            (2.633800e+05    9.761869e-05)
            (2.684450e+05    1.012168e-04)
            (2.735100e+05    1.047998e-04)
            (2.785750e+05    1.083684e-04)
            (2.836400e+05    1.119234e-04)
            (2.887050e+05    1.154658e-04)
            (2.937700e+05    1.189971e-04)
            (2.988350e+05    1.225188e-04)
            (3.039000e+05    1.260326e-04)
        )
    )
    (
        2e-06
        (
            (1.013000e+04    2.012729e-06)
            (1.519500e+04    2.014176e-06)
            (2.026000e+04    2.016220e-06)
            (2.532500e+04    2.018880e-06)
            (3.039000e+04    2.022182e-06)
            (3.545500e+04    2.026157e-06)
            (4.052000e+04    2.030849e-06)
            (4.558500e+04    2.036308e-06)
            (5.065000e+04    2.042598e-06)
            (5.571500e+04    2.049801e-06)
            (6.078000e+04    2.058015e-06)
            (6.584500e+04    2.067367e-06)
            (7.091000e+04    2.078019e-06)
            (7.597500e+04    2.090182e-06)
            (8.104000e+04    2.104137e-06)
            (8.610500e+04    2.120271e-06)
            (9.117000e+04    2.139141e-06)
            (9.623500e+04    2.161591e-06)
            (1.013000e+05    2.189012e-06)
            (1.063650e+05    2.224025e-06)
            (1.114300e+05    2.273080e-06)
            (1.164950e+05    2.386188e-06)
            (1.215600e+05    3.956229e-06)
            (1.266250e+05    6.955147e-06)
            (1.316900e+05    1.020165e-05)
            (1.367550e+05    1.358128e-05)
            (1.418200e+05    1.705585e-05)
            (1.468850e+05    2.060063e-05)
            (1.519500e+05    2.419745e-05)
            (1.570150e+05    2.783244e-05)
            (1.620800e+05    3.149493e-05)
            (1.671450e+05    3.517679e-05)
...
);
