run/acousticCavitationCloudFoam/validation_cubicReactor3D_Nowak2013/constant/charactMap_Nowak2013_VAv_OF
// A characteristic map for 
// VAv(REqu, pAc)
// data(
//     equilibrium radius,
//     acoustic pressure amplitude
// )
//
// Loaded via transportProperties.
//
// Table structure:
//  (
//      REqu 1
//      (
//          (pAc 1     VAv 1)
//          (pAc 2     VAv 2)
//          (...)
//      )
//      REqu 2
//      (...
//      )
//  )
(
    (
        1e-06
        (
            (1.013000e+04    4.252328e-18)
            (1.519500e+04    4.260113e-18)
            (2.026000e+04    4.271101e-18)
            (2.532500e+04    4.285381e-18)
            (3.039000e+04    4.303074e-18)
            (3.545500e+04    4.324335e-18)
            (4.052000e+04    4.349353e-18)
            (4.558500e+04    4.378363e-18)
            (5.065000e+04    4.411648e-18)
            (5.571500e+04    4.449551e-18)
            (6.078000e+04    4.492487e-18)
            (6.584500e+04    4.540958e-18)
            (7.091000e+04    4.595576e-18)
            (7.597500e+04    4.657092e-18)
            (8.104000e+04    4.726432e-18)
            (8.610500e+04    4.804760e-18)
            (9.117000e+04    4.893552e-18)
            (9.623500e+04    4.994720e-18)
            (1.013000e+05    5.110789e-18)
            (1.063650e+05    5.245194e-18)
            (1.114300e+05    5.402767e-18)
            (1.164950e+05    5.590615e-18)
            (1.215600e+05    5.819849e-18)
            (1.266250e+05    6.109404e-18)
            (1.316900e+05    6.496223e-18)
            (1.367550e+05    7.073290e-18)
            (1.418200e+05    8.549276e-18)
            (1.468850e+05    3.833388e-14)
            (1.519500e+05    1.149248e-13)
            (1.570150e+05    2.263691e-13)
            (1.620800e+05    3.748503e-13)
            (1.671450e+05    5.624341e-13)
            (1.722100e+05    7.909642e-13)
            (1.772750e+05    1.062054e-12)
            (1.823400e+05    1.377103e-12)
            (1.874050e+05    1.737316e-12)
            (1.924700e+05    2.143722e-12)
            (1.975350e+05    2.597202e-12)
            (2.026000e+05    3.098498e-12)
            (2.076650e+05    3.648234e-12)
            (2.127300e+05    4.246930e-12)
            (2.177950e+05    4.895013e-12)
            (2.228600e+05    5.592827e-12)
            (2.279250e+05    6.340645e-12)
            (2.329900e+05    7.138678e-12)
            (2.380550e+05    7.987078e-12)
            (2.431200e+05    8.885950e-12)
            (2.481850e+05    9.835356e-12)
            (2.532500e+05    1.083532e-11)
            (2.583150e+05    1.188583e-11)
            (2.633800e+05    1.298685e-11)
            (2.684450e+05    1.413831e-11)
            (2.735100e+05    1.534014e-11)
            (2.785750e+05    1.659222e-11)
            (2.836400e+05    1.789443e-11)
            (2.887050e+05    1.924665e-11)
            (2.937700e+05    2.064873e-11)
            (2.988350e+05    2.210052e-11)
            (3.039000e+05    2.360187e-11)
        )
    )
    (
        2e-06
        (
            (1.013000e+04    3.418130e-17)
            (1.519500e+04    3.428929e-17)
            (2.026000e+04    3.444245e-17)
            (2.532500e+04    3.464287e-17)
            (3.039000e+04    3.489337e-17)
            (3.545500e+04    3.519764e-17)
            (4.052000e+04    3.556037e-17)
            (4.558500e+04    3.598754e-17)
            (5.065000e+04    3.648675e-17)
            (5.571500e+04    3.706763e-17)
            (6.078000e+04    3.774256e-17)
            (6.584500e+04    3.852762e-17)
            (7.091000e+04    3.944407e-17)
            (7.597500e+04    4.052060e-17)
            (8.104000e+04    4.179712e-17)
            (8.610500e+04    4.333113e-17)
            (9.117000e+04    4.520950e-17)
            (9.623500e+04    4.757231e-17)
            (1.013000e+05    5.066745e-17)
            (1.063650e+05    5.500369e-17)
            (1.114300e+05    6.199151e-17)
            (1.164950e+05    8.491538e-17)
            (1.215600e+05    1.549411e-15)
            (1.266250e+05    1.346060e-14)
            (1.316900e+05    4.287217e-14)
            (1.367550e+05    9.455570e-14)
            (1.418200e+05    1.726009e-13)
            (1.468850e+05    2.805559e-13)
            (1.519500e+05    4.215028e-13)
            (1.570150e+05    5.981165e-13)
            (1.620800e+05    8.127157e-13)
            (1.671450e+05    1.067307e-12)
...
);
