run/acousticCavitationCloudFoam/validation_cubicReactor3D_Nowak2013/0_orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField uniform 0.0001;

boundaryField
{
    sonotrodeBottom
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    sonotrodeLateralWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    metallicWall
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    acrylicWalls
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
