run/acousticCavitationCloudFoam/validation_cubicReactor3D_Nowak2013/0_orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField uniform 0.1;

boundaryField
{
    sonotrodeBottom
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    sonotrodeLateralWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    metallicWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    acrylicWalls
    {
        type            omegaWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
