run/acousticCavitationCloudFoam/validation_cubicReactor3D_Nowak2013/0_orig/phiPAc
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      phiPAc;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    acrylicWalls
    {
        type zeroGradient;
    }
    sonotrodeBottom
    {
        type zeroGradient;
    }
    metallicWall
    {
        type zeroGradient;
    }
    sonotrodeLateralWall
    {
        type zeroGradient;
    }
}

// ************************************************************************* //
